// ignore_for_file: camel_case_types

import 'package:flutter/material.dart';
import 'package:test2/pages/Search.dart';

class Traub_g_kod extends StatefulWidget {
  const Traub_g_kod({super.key});

  @override
  State<Traub_g_kod> createState() => _Traub_g_kodState();
}

class _Traub_g_kodState extends State<Traub_g_kod> {
  List<String> _allLines = [];
  List<String> _filteredLines = [];
  final TextEditingController _searchController = TextEditingController();
  final lines = <String>[
    "G00 Прямо на ускорреном ходу",
    "G01* Подача по прямой",
    "G02 Дуги окружности по часовой стрелке (вправо)",
    "G03 Дуги окружности против часовой стрелки (влево)",
    "G04 Время ожидания",
    "G08 Подача по подаче (активный контроль)",
    "G09 Подача по прямой (точный останов)",
    "G10 Функция фрезерования выключена",
    "G11 Функция фрезерования включена",
    "G14 Синхрон. резание выкл.",
    "G15 Синхрон. резание вкл.",
    "G16 Плоскость фрезерования Боковая поверхность",
    "G17 Плоскость фрезерования Торцовая поверхность",
    "G18 Плоскость фрезерования X/Z (режим обточки)",
    "G19 Плоскость фрезерования Продольная резка/Тангентальная плоскость",
    "G20 Выбор программирования в дюймах",
    "G21 Выбор программирования в мм",
    "G22 Вызов подпрограммы",
    "G24–G27 Подвод к точке смены инструмента",
    "G28 Подвод к точке начала отсчёта",
    "G33* Нарезание резьбы в отдельном блоке данных/ при покадровой обработке",
    "G34 Нарезание резьбы в отдельном блоке (изменяемый шаг)",
    "G387 Синхронизированное нарезание резьбы",
    "G36 Открытие памяти программы",
    "G37 Открытие памяти (данных) инструмента",
    "G38 Открытие памяти параметров",
    "G40 Компенсация радиуса режущей кромки выключена",
    "G41 Компенсация радиуса резца или фрезы включена, инструмент слева от контура ",
    "G42 Компенсация радиуса резца или фрезы включена, инструмент справа от контура",
    "G46 Компенсация радиуса резца включена",
    "G53 Ускоренный ход по прямой, координаты относительно нуля станка",
    "G54–G57 Смещение нуля",
    "G59 Аддативное смещение нулевой точки",
    "G63 Датчик угла поворота ГШП",
    "G64 Датчик угла поворота КШП",
    "G65 Выключение барьерных точек",
    "G66 Включение барьерных точек",
    "G70 Цикл черновой обработки для инструмента с отрицательным углом установки",
    "G71 Цикл черновой обработки – продольно",
    "G72 Цикл черновой обработки – поперечно",
    "G73 Цикл черновой обработки – параллельно контуру",
    "G74 Цикл черновой обработки с прерывистым резанием – продольно",
    "G75 Цикл черновой обработки с прерывистым резанием – поперечно",
    "G76 Цикл нарезания резьбы – продольно",
    "G77 Цикл фаски – продольно",
    "G78 Цикл нарезания резьбы (специальная резьба)",
    "G79 Цикл снятия фаски – поперечная",
    "G81 Цикл повтора (G77, G78, G79)",
    "G82 Цикл нарезания резьбы (метчик, плашка)",
    "G83 Цикл глубокого сверления 1",
    "G84 Цикл глубокого сверления 2",
    "G86 Цикл нарезания резьбы – поперечная",
    "G88 Нисходящий контур включен (G71, G72, G73)",
    "G89 Функция G88 выключена",
    "G90 Программирование оси C–V в абсолютных размерах",
    "G91 Программирование оси C–V в составных размерах",
    "G92 Ограничение числа оборотов/ остаточный путь удалить",
    "G94 Подача в мм/мин",
    "G95 Подача в мм/об.",
    "G96 Постоянная скорость резания",
    "G97 Число оборотов",
    "G98 Коррекция подачи включена",
    "G99 Коррекция подачи выключена",
    "G101 Автоматическое конструирование геометрии I –продольная",
    "G102 Автоматическое конструирование геометрии I–поперечная",
    "G122 Запуск фоновой подсистемы",
    "G140 Кроссировать",
    "G156 Соединение/ наложение",
    "G164 Распознав. направ. вращ. инструмента с приводом при опережении/ отставании",
    "G113 Отмена G164",
    "G307 Удалить позиционир. с остаточ. значением",
    "G308 AWUE",
    "G309 Диагностика",
    "G314 Синхронизация шпинделей",
    "G315 Многогранная обработка",
    "G316 Обработка черв. фрезой",
    "G319 Позиционирование шпинделя без оси С",
    "G364 Наложение частоты вращения шпинделей",
    "G387 Нарез. резьбы, без выдвиж. держателя (синхрониз.)",
    "G201 – G299 Вызов макросов пользователя",
    "G301 - G399 Вызов макросов фирмы TRAUB",
  ];

  @override
  void initState() {
    super.initState();
    _searchController.addListener(_filterLines);
    _filteredLines = lines;
  }

  void _filterLines() {
    setState(() {
      _allLines = lines;
      _filteredLines = lines;
    });
    final query = _searchController.text.toLowerCase();

    if (query.isEmpty) {
      setState(() {
        _filteredLines = lines;
      });
    } else {
      setState(() {
        _filteredLines = _allLines
            .where((line) => line.toLowerCase().contains(query))
            .toList();
      });
    }
  }

  @override
  Widget build(BuildContext context) {
    return BodySearchKod(
      searchController: _searchController,
      filteredLines: _filteredLines,
    );
  }
}
