// ignore_for_file: camel_case_types

import 'package:flutter/material.dart';
import 'package:test2/pages/Search.dart';

class Traub_m_kod extends StatefulWidget {
  const Traub_m_kod({super.key});

  @override
  State<Traub_m_kod> createState() => _Traub_m_kodState();
}

class _Traub_m_kodState extends State<Traub_m_kod> {
  List<String> _allLines = [];
  List<String> _filteredLines = [];
  final TextEditingController _searchController = TextEditingController();
  final lines = <String>[
    "М00 Запрограммированный останов",
    "М01 Останов по выбору (при нажатой кнопке М01)",
    "М03 ГШпиндель по часовой стрелке (вправо)",
    "М04 ГШпиндель против часовой стрелки (влево)",
    "М05 Останов Гшпинделя",
    "М07 Подача СОЖ включена. Высокое давление",
    "М08 Подача СОЖ включена",
    "М09 Подача СОЖ выключена",
    "М10 Зажим заготовки Основной шпиндель",
    "М11 Высвобождение заготовки Основной шпиндель",
    "М17 Ось С включена",
    "М18 Ось С выключена",
    "М19 Закрыть фиксир. тормоз ГШП",
    "М30 Конец программы с возвратом ",
    "М32 Вкл. отражение 1-й оси",
    "М33 Выкл. отражение 1-й оси",
    "М35 Вкл. сбег резьбы над углом",
    "М36 Выкл. сбег резьбы над углом",
    "М37 Вкл. ось Y1 виртуально",
    "М38 Выкл. ось Y1 виртуально",
    "М40 ГШП Ступень передачи 1 \$1 (S1)",
    "М41 ГШП Ступень передачи 2 \$1 (S1)",
    "М42 ГШП Ступень передачи 3 \$1 (S1)",
    "М43 ГШП Ступень передачи 4 \$1 (S1)",
    "М48 Перекл. руч. коррекции подачи и част.вращ. активен",
    "М49 Перекл. руч. коррекции подачи и част.вращ. неактивен",
    "М51 Зажим люнета разжат",
    "М52 Зажим люнета прижат",
    "М58 Выкл. промывку раб. пространства ГШП/КШП (СОЖ)",
    "М59 Вкл. промывку раб. пространства ГШП/КШП (СОЖ)",
    "М60 Смена прутка",
    "М61 Смена прутка профильный материал",
    "М62 Закр. устройство захвата",
    "М63 Откр. устройство захвата",
    "М66 Револьвер закр. устройство захвата",
    "М67 Револьвер откр. устройство захвата",
    "М70 Откр. фикс. тормоз ГШП",
    "М71 Разжим задней бабки",
    "М72 Зажим задней бабки",
    "М73 Демпферный тормоз прижат (только в режиме оси С)",
    "М74 Демпферный тормоз разжат (только в режиме оси С)",
    "М77 Зажим заготовки разжат при вращении ГШП ( в соединении с М11)",
    "М78 Выключ. Функция М77 ",
    "М80 Зажим люнета 1",
    "М81 Разжим люнета 1",
    "М82 Зажим люнета 2",
    "М83 Разжим люнета 2",
    "М84 Каретка люнета вперед",
    "М85 Каретка люнета назад",
    "М92 Транспортер стружки включен",
    "М93 Транспортер стружки выключен",
    "М94 Устройство снятия детали спереди",
    "М95 Устройство снятия детали сзади",
    "М96 Устройство снятия детали поз. ожидания (М94 или М95)",
    "М97 Устройство снятия детали, ускоренный ход (М94 или М95)",
    "М99 Конец подпрограммы",
    "М101 Блокировка записи данных \$1 включена",
    "М102 Блокировка записи данных \$1 выключена",
    "М103 ГШП вкл., правый ход \$1 (S1)",
    "М104 ГШП вкл., левый ход \$1 (S1)",
    "М105 ГШП останов \$1 (S1)",
    "М107 Вкл. промывку рев.1 высок. давл. (из друг. подсистемы) (СОЖ)",
    "М108 Вкл. промывку рев.1 низк. давл./ вкл. внутр. промывку фрезерного узла (СОЖ) ",
    "М109 Выкл. промывку рев.1/ выкл. внутр. промывку фрезерного узла (СОЖ)",
    "М110 Зажать деталь в ГШП",
    "М111 Освободить деталь в ГШП",
    "М112 Позиционировать ГШП \$1 (S1)",
    "М114 Закр. направл. втулку",
    "М115 Закр. направл. втулку, выс. давление",
    "М116 Откр. направл. втулку",
    "М117 Вкл. ось С ГШП",
    "М118 Выкл. ось С ГШП",
    "М122 Огран. крут. момента 2 шп. 1 вкл.",
    "М122 Огран. крут. момента 2 шп. 1 выкл.",
    "М127 Включение оси С ГШП без исходной точки",
    "М128 Дополнительный блок параметров для преобразователя частот ГШП",
    "М129 Дополнительный блок параметров для преобразователя частот КШП",
    "М130 Проверка прод. обточки",
    "М131 Проверка коротк. обточки",
    "М132 Зеркальная обработка включена. Вторая ось",
    "М132 Зеркальная обработка выключена. Вторая ось",
    "М134 Включение закоммент. блоков",
    "М135 Точный останов включен",
    "М136 Точный останов выключен",
    "М137 Синхронизация покадр. обработки вкл.",
    "М138 Синхронизация покадр. обработки выкл.",
    "М140 ГШП ступень передачи 1 \$1 (S1)",
    "М141 ГШП ступень передачи 2 \$1 (S1)",
    "М142 ГШП ступень передачи 3 \$1 (S1)",
    "М143 ГШП ступень передачи 4 \$1 (S1)",
    "М150 Вкл. промывку через ГШП (через таймер 16173) (СОЖ)",
    "М151 Вкл. глуб. сверление рев.1, 2 поз-я",
    "М152 Выкл. глуб. сверление рев.1, 2 поз-я",
    "М156 Ось В промывка вкл. (СОЖ)",
    "М157 Ось В промывка выкл. (СОЖ)",
    "М160 Вкл. промывку через ГШП (СОЖ)",
    "М161 Выкл. промывку через ГШП (СОЖ)",
    "М177 Зажим детали 1 открыт при вращении ГШП (в комбинации с М111)",
    "М178 Выкл. функции М177",
    "М187 Вкл. разблок. сдвига магазина (G87)",
    "М188 Выкл. разблок. сдвига магазина (G87)",
    "М192 Откр. кожух транспортёра деталей",
    "М193 Закр. кожух транспортёра деталей",
    "М194 Лента подачи деталей вкл./ вперёд",
    "М195 Лента подачи деталей выкл./ назад",
    "М201 Блокировка записи данных \$2 включена",
    "М202 Блокировка записи данных \$2 выключена",
    "М203 КШП правый ход, \$2 (S2)",
    "М204 КШП левый ход ход, \$2 (S2)",
    "М205 КШП останов \$2 (S2)",
    "М207 Вкл. промывку рев.2 выс. давл. (из другой подсист.) (СОЖ)",
    "М208 Вкл. промывку рев.2 низкое давл. (из другой подсист.) (СОЖ)",
    "М209 Выкл. промывку рев.2 (из другой подсист.) (СОЖ)",
    "М210 Зажать деталь в КШП",
    "М211 Разжать деталь в КШП",
    "М217 Вкл. ось С КШП",
    "М218 Выкл. ось С КШП",
    "М219 КШП, закр. тормоз остановки",
    "М222 Огранич. крут. момента 2 шп. 2 вкл",
    "М223 Огранич. крут. момента 2 шп. 2 выкл",
    "М227 Вкл. ось С КШП, без точки начала отсчёта (режим 2)",
    "М232 Вкл. отражение 3-й оси",
    "М233 Выкл. отражение 3-й оси",
    "М235 Точный останов 2 включен",
    "М236 Точный останов 2 выключен",
    "М237 Вкл. ось Y2 виртуально, реж. синхр. ",
    "М238 Выкл. ось Y2 виртуально, реж. синхр. ",
    "М240 КШП ступень передачи 1 \$2 (S2)",
    "М241 КШП ступень передачи 2 \$2 (S2)",
    "М242 КШП ступень передачи 3 \$2 (S2)",
    "М243 КШП ступень передачи 4 \$2 (S2)",
    "М250 Вкл. промывку через КШП (через таймер 16172) (СОЖ)",
    "М251 Вкл. глубокое сверление рев.2 поз-я 2",
    "М252 Выкл. глубокое сверление рев.2 поз-я 2",
    "М260 Вкл. промывку через КШП (СОЖ)",
    "М261 Выкл. промывку через КШП (СОЖ)",
    "М268 Вкл. промывку на ГШП/КШП (СОЖ)",
    "М269 Выкл. промывку на ГШП/КШП (СОЖ)",
    "М270 КШП откр. тормоз остановки",
    "М271 Вкл. глубокое сверление рев.2",
    "М272 Выкл. глубокое сверление рев.2",
    "М277 Разжать деталь в КШП при вращении (в комбин. с М211)",
    "М278 Выкл. функцию М277",
    "М294 Лента подачи деталей 2 вкл./ вперёд",
    "М295 Лента подачи деталей 2 выкл./ назад",
    "М303 Вращающий привод включен, правый ход \$1 S3",
    "М304 Вращающий привод включен, левый ход \$1 S3",
    "М305 Вращающий привод выключен. \$1 S3",
    "М332 Зеркальная обработка включена. 4-я ось",
    "М333 Зеркальная обработка выключена. 4-я ось",
    "М340 Выбор ступени коробки передач 1 (S3)",
    "М341 Выбор ступени коробки передач 2 (S3)",
    "М407 Вкл. промывку задн. аппарат, высок. давление (из другой подсистемы) (СОЖ)",
    "М408 Вкл. промывку задн. аппарат, низк. давление (из другой подсистемы) (СОЖ)",
    "М409 Выкл. промывку задн. аппарат (из другой подсистемы) (СОЖ)",
    "М452 Промывка задн. аппарат, поз. 12 (СОЖ)",
    "М454 Промывка задн. аппарат, поз. 14 (СОЖ)",
    "М456 Промывка задн. аппарат, поз. 16 (СОЖ)",
    "М457 Промывка задн. аппарат, поз. 17 (СОЖ)",
    "М459 Выкл. промывку задн. аппарат (СОЖ)",
    "М466 Вкл. промывку задн. аппарат снаружи вверху (СОЖ)",
    "М467 Выкл. промывку задн. аппарат снаружи вверху (СОЖ)",
    "М468 Вкл. промывку задн. аппарат снаружи внизу (СОЖ)",
    "М469 Выкл. промывку задн. аппарат снаружи внизу (СОЖ)",
    "М471 Глубокое сверление, задн. аппарат вкл",
    "М472 Глубокое сверление, задн. аппарат выкл",
    "М503 Вкл. привод инструмента 1, правый ход \$1 (S5) (вертикальное расположение фрезы)",
    "М504 Вкл. привод инструмента 1, левый ход \$1 (S5) (горизонтальное расположение фрезы)",
    "М505 Выкл. привод инструмента 1, \$1 (S5)",
    "М512 Позиционировать привод инструмента 1 \$1 (S5) (G319)",
    "М540 Привод инстр. 1, ступень передачи 1 \$1 (S5)",
    "М541 Привод инстр. 1, ступень передачи 2 \$1 (S5)",
    "М542 Привод инстр. 1, ступень передачи 3 \$1 (S5)",
    "М543 Привод инстр. 1, ступень передачи 4 \$1 (S5)",
    "М603 Вкл. привод инструмента 2, правый ход \$2 (S6)",
    "М604 Вкл. привод инструмента 2, левый ход \$2 (S6)",
    "М605 Выкл. привод инструмента 2, \$2 (S6)",
    "М612 Позиционировать привод инстум. 2 \$2 (S6) (G319)",
    "М640 Привод инстр. 2, ступень передачи 1 \$1 (S6)",
    "М641 Привод инстр. 2, ступень передачи 2 \$1 (S6)",
    "М642 Привод инстр. 2, ступень передачи 3 \$1 (S6)",
    "М643 Привод инстр. 2, ступень передачи 4 \$1 (S6)",
    "М703 Задание направления включения револьверной головки правый ход",
    "М704 Задание направления включения револьверной головки левый ход",
    "М730 Счетчик деталей при работе без М30",
    "М762 Термокомпенсация",
    "М765 Специальные параметры для температурной компенсации",
    "М777 Счетчик деталей при работе без М30 (срабатывает сообщ. LSV2/TDDE)",
    "М803 Вкл. привод задн. аппарата, правый ход \$4 (S8)",
    "М804 Вкл. привод задн. аппарата, левый ход \$4 (S8)",
    "М805 Выкл. привод задн. аппарата, \$4 (S8)",
    "М812 Позиционировать задн. аппарат \$4 (S8) (G319)",
    "М840 Привод задн. аппарата, ступень передачи 1 \$4 (S8)",
    "М841 Привод задн. аппарата, ступень передачи 2 \$4 (S8)",
    "М842 Привод задн. аппарата, ступень передачи 3 \$4 (S8)",
    "М843 Привод задн. аппарата, ступень передачи 4 \$4 (S8)",
    "М901 Проверка синхронизации (G22)",
    "М907 СОЖ выс. давление (G907)",
    "М908 СОЖ низкое давление (G908)",
    "М909 СОЖ глубокое сверление (G909)",
    "М912 G312 (направляющая втулка)",
    "М914 Синхр. шпинделей (G314)",
    "М915 Многогранная обработка (G315)",
    "М916 Обработка червячной фрезой (G316)",
    "М919 Позиционирование шпинделя (G319)",
    "М920 Квитировать измереие ",
    "М939 Проверка синхронизации (G940)",
    "М940 Синхронизировать шпиндели (G314)",
    "М941 Выкл. синхр. шпинделей (G314)",
    "М951 Выкл. многогранную обработку (G315)",
    "М952 Считать положение оси (точный останов) (G952)",
    "М953 Револьвер переключение вправо",
    "М954 Револьвер переключение влево",
    "М957 Револьвер скорость вкл. 1 (по умолч. 25%)",
    "М958 Револьвер скорость вкл. 2 (по умолч. 50%)",
    "М961 Выкл. обработку червячной фрезой (G316)",
    "М987 Нарезание резьбы (G387)",
    "М988 Выкл. нарезание резьбы (G387)",
    "М992 Ожидание синхрометки в подсистеме  \$2",
  ];

  @override
  void initState() {
    super.initState();
    _searchController.addListener(_filterLines);
    _filteredLines = lines;
  }

  @override
  void dispose() {
    _searchController.dispose();
    super.dispose();
  }

  void _filterLines() {
    setState(() {
      _allLines = lines;
      _filteredLines = lines;
    });
    final query = _searchController.text.toLowerCase();

    if (query.isEmpty) {
      setState(() {
        _filteredLines = lines;
      });
    } else {
      setState(() {
        _filteredLines = _allLines
            .where((line) => line.toLowerCase().contains(query))
            .toList();
      });
    }
  }

  @override
  Widget build(BuildContext context) {
    return BodySearchKod(
      searchController: _searchController,
      filteredLines: _filteredLines,
    );
  }
}
