// ignore_for_file: camel_case_types

import 'package:flutter/material.dart';
import 'package:test2/widgets/Search.dart';

class Fanuc_M_kod extends StatefulWidget {
  const Fanuc_M_kod({super.key});

  @override
  State<Fanuc_M_kod> createState() => _Fanuc_M_kodState();
}

class _Fanuc_M_kodState extends State<Fanuc_M_kod> {
  List<String> _allLines = [];
  List<String> _filteredLines = [];
  final TextEditingController _searchController = TextEditingController();
  final lines = <String>[
    "М00 Запрограммированный останов",
    "М01 Останов по выбору (при нажатой кнопке М01)",
    "M02 Конец программы",
    "М03 ГШП по часовой стрелке (вправо)",
    "М04 ГШП против часовой стрелки (влево)",
    "М05 Останов шпинделя",
    "М06 Выбор инструмента в магазине / смена инструмента",
    "М08 Подача СОЖ включена",
    "М09 Подача СОЖ выключена",
    "М10 Зажим заготовки Основной шпиндель",
    "М11 Высвобождение заготовки Основной шпиндель",
    "М13 М3 + М8",
    "М14 М4 + М8",
    "М15 М5 + М9",
    "М23 Вращение поперечного приводного инстр. по часовой стрелке",
    "М24 Вращение поперечного приводного инстр. против часовой стрелки",
    "М25 Останов поперечного приводного инстр.",
    "М26 Выдвижение ловушки/ старт конвеера (опция)",
    "М27 Убирание ловушки/ стоп конвеера (опция)",
    "М29 Жёсткое резьбонарезание",
    "М30 Конец программы с возвратом ",
    "М33 Вращение осевого приводного инстр. по часовой стрелке",
    "М34 Вращение осевого приводного инстр. против часовой стрелки",
    "М35 Остановка вращения осевого приводного инстр.",
    "М40 ВКЛ. обдува",
    "М41 ВЫКЛ. обдува",
    "М50 ВКЛ осей С ГШП/ противошпинделя",
    "М51 ВЫКЛ осей С ГШП/ противошпинделя",
    "М54 Синхронизация осей С ГШП/ противошпинделя",
    "М55 Откл. синхронизации осей С ГШП/ противошпинделя",
    "М56 Синхронизация вращения ГШП/ противошпинделя",
    "М57 Откл. синхронизации вращения ГШП/ противошпинделя",
    "М60 ВКЛ. барфидера",
    "М61 ВЫКЛ. барфидера",
    "М62 Смена прутка",
    "М78 Выход выталкивателя вперёт",
    "М79 Отход выталкивателя назад",
    "М82 Вкл. тормоза ГШП/ противошпинделя",
    "М83 Выкл. тормоза ГШП/ противошпинделя",
    "М91 Вызов программы автомат. головки обратботки прутка О 9001",
    "М95 Вкл монитора смены прутка",
    "М96 Выкл монитора смены прутка",
    "М97 Вкл счётчика деталей",
    "М98 Вызов подпрограммы",
    "М99 Зацикливание программы/ возврат из подпрограммы",
    "М103 Вращение противошпинделя по часовой стрелке",
    "М104 Вращение противошпинделя против часовой стрелки",
    "М105 Остановка вращения противошпинделя",
    "М123 Вкл. вращения обратного осевого приводного инстр. по часовой стрелке",
    "М124 Вкл. вращения обратного осевого приводного инстр. против часовой стрелки",
    "М125 Выкл. вращения обратного осевого приводного инстр.",
    "М186 Вкл. конвеер стружки",
    "М187 Выкл. конвеер стружки",
    "М220 Отключение синхронной работы осей Z1-Z2",
    "М221 Вкл. синхронной работы осей Z1-Z2",
    "М260 Вкл. станции высокого давления (совместно с М08) (СОЖ)",
    "М261 ВКЛ 1-го канала (СОЖ)",
    "М262 ВЫКЛ 1-го канала (СОЖ)",
    "М263 ВКЛ 2-го канала (СОЖ)",
    "М264 ВЫКЛ 2-го канала (СОЖ)",
    "М500 - М599 Команды синхр. каналов",
    "М9**** Вызов подпрограммы",
  ];

  @override
  void initState() {
    super.initState();
    _searchController.addListener(_filterLines);
    _filteredLines = lines;
  }

  @override
  void dispose() {
    _searchController.dispose();
    super.dispose();
  }

  void _filterLines() {
    setState(() {
      _allLines = lines;
      _filteredLines = lines;
    });
    final query = _searchController.text.toLowerCase();

    if (query.isEmpty) {
      setState(() {
        _filteredLines = lines;
      });
    } else {
      setState(() {
        _filteredLines = _allLines
            .where((line) => line.toLowerCase().contains(query))
            .toList();
      });
    }
  }

  @override
  Widget build(BuildContext context) {
    return BodySearchKod(
      searchController: _searchController,
      filteredLines: _filteredLines,
    );
  }
}
